[
    "The person who invented the door knock won the No-bell prize.",
    "I couldn't work out how to fasten my seatbelt. Then it clicked.",
    "Never trust atoms, they make up everything.",
    "Singing in the shower is all fun and games until you get shampoo in your mouth, then it just becomes a soap opera.",
    "I can't believe I got fired from the calendar factory. All I did was take a day off.",
    "To the guy who invented Zero: Thanks for nothing!",
    "Enough with the cripple jokes!...I just can't stand them.",
    "I've accidentally swallowed some Scrabble tiles. My next crap could spell disaster.",
    "There are plenty of fish in the sea but until I catch one I'm just stuck here holding my rod...",
    "Did you hear about the guy who got hit in the head with a can of soda? He was lucky it was a soft drink.",
    "When William joined the army he disliked the phrase 'fire at will'.",
    "There was a sign on the lawn at a drug re-hab center that said 'Keep off the Grass'.",
    "I wondered why the baseball was getting bigger. Then it hit me.",
    "I can hear music coming out of my printer. I think the paper's jammin' again.",
    "I have a few jokes about unemployed people, but it doesn't matter none of them work",
    "Want to hear a construction joke? I'm working on it",
    "I always take a second pair of pants when I go golfing... in case I get a hole in one.",
    "I couldn't quite remember how to throw a boomerang, but eventually it came back to me.",
    "So i've decided that my wifi will be my valentine. IDK, we just have this connection.",
    "I was going to tell a Mexican joke, but that's just crossing the border!",
    "A prisoner's favorite punctuation mark is the period. It marks the end of his sentence.",
    "what do you call a fake noodle? an IMPASTA!",
    "I'm trying to think of a Miley Cyrus joke but its not twerking.",
    "I'm going to stand outside, so if anyone asks I'm outstanding.",
    "I used to go fishing with Skrillex, but they kept dropping the bass.",
    "I just realised that I haven't done the hokey pokey in over 10 years. I guess when you get older, you just forget what it's all about.",
    "2 antennas met on a roof and got married. The wedding was ok, but the reception was incredible.",
    "A book just fell on my head. I've only got my shelf to blame.",
    "This girl said she recognized me from the vegetarian club",
    "I dropped my burger on the floor. Now it's ground beef.",
    "I used to have a fear of hurdles, but I got over it.",
    "The outcome of war does not prove who is right, but only who is left.",
    "Darth Vader once made cookies, but they were a little on the dark side.",
    "The store keeps calling me to come back and buy more furniture... but all i really wanted was a one night stand.",
    "This girl said she recognized me from the vegetarian club, but I'd never met herbivore.",
    "Police arrested two kids yesterday, one was drinking battery acid, the other was eating fireworks. They charged one and let the other one off...",
    "No more Harry Potter jokes guys, I'm Sirius.",
    "It was hard getting over my addiction to hokey pokey, but I've turned myself around.",
    "Why can't a bike stand on it's own? Because it is two tired.",
    "It takes a lot of balls to golf the way I do.",
    "Why did everyone want to hang out with the mushroom? Because he was a fungi.",
    "How much does a hipster weigh? An instagram",
    "I used to be addicted to soap, but I'm clean now.",
    "When life gives you melons, you’re probably dyslexic.",
    "Stop with the blind jokes...I dont see their point",
    "If Apple made a car, would it have Windows?",
    "Need an ark to save two of every animal? I noah guy.",
    "The scare crow got promoted to the manager at a supermarket, because he was outstanding in his field",
    "What is the difference between a nicely dressed man on a tricycle and a poorly dressed man on a bicycle? A tire.",
    "What do you do with a sick chemist? If you can't helium, and you can't curium, you might as well barium.",
    "I'm reading a book about anti-gravity. It's impossible to put down.",
    "To write with a broken pencil is pointless.",
    "Where do TVs go on vacation? To remote islands!",
    "I was going to tell a midget joke, but it's too short.",
    "Jokes about German sausage are the wurst.",
    "How do you organize a space party? You planet.",
    "Sleeping comes so naturally to me, I could do it with my eyes closed.",
    "I'm glad I know sign language, it's pretty handy.",
    "Atheism is a non-prophet organization.",
    "Velcro - what a rip-off!",
    "They should make a Minecraft movie, it would be a blockbuster.",
    "I don't trust people with graph paper. They're always plotting something",
    "I had a friend who was addicted to brake fluid. He says he can stop anytime.",
    "They told me I had Type A blood, but it was a Type O.",
    "I went to to the shop to buy 8 sprites i came home and realised I'd picked 7Up",
    "Why are iPhone chargers not called Apple Juice?",
    "There was an explosion at a pie factory, 3.14 people died.",
    "A man drove his expensive car into a tree and found out how a Mercedes bends",
    "I'm glad I know sign language, it's pretty handy.",
    "The experienced carpenter really nailed it, but the new guy screwed everything up.",
    "I didn't like my beard at first but then it grew on me.",
    "Smaller babies may be delivered by stork but the heavier ones need a crane.",
    "What's the definition of a will? (It's a dead giveaway).",
    "I was going to look for my missing watch, but I could never find the time.",
    "I usually take steps to avoid elevators.",
    "Did you hear about the guy whose whole left side was cut off? He's all right now.",
    "It's not that the man did not know how to juggle, he just didn't have the balls to do it.",
    "I used to be a banker but I lost interest",
    "I don't trust these stairs because they're always up to something.",
    "My friend's bakery burned down last night. Now his business is toast.",
    "Don't trust people that do acupuncture, they're back stabbers.",
    "The man who survived mustard gas and pepper spray is now a seasoned veteran.",
    "Police were called to a daycare where a three-year-old was resisting a rest.",
    "Atheism is a non-prophet organization.",
    "When Peter Pan punches, they Neverland",
    "The shoemaker did not deny his apprentice anything he needed. He gave his awl.",
    "I did a theatrical performance about puns. Really it was just a play on words.",
    "Show me a piano falling down a mineshaft and I'll show you A-flat minor.",
    "Have you ever tried to eat a clock? It's very time consuming.",
    "There was once a cross-eyed teacher who couldn't control his pupils.",
    "A new type of broom came out, it is sweeping the nation.",
    "I relish the fact that you've mustard the strength to ketchup to me.",
    "The roundest knight at king Arthur's round table was Sir Cumference.",
    "I knew a woman who owned a taser, man was she stunning!",
    "What did the grape say when it got stepped on? Nothing - but it let out a little whine.",
    "It was an emotional wedding. Even the cake was in tiers.",
    "When a clock is hungry it goes back four seconds.",
    "I tried to catch fog but I mist.",
    "I feel sorry for shopping trolleys. They're always getting pushed around.",
    "I tried to make an agriculture joke but it was too corny.",
    "You can tune a guitar, but you can't tuna fish.",
    "They're selling dead batteries, free of charge.",
    "Where do you go when you feel cold in a square room? The corners, they are always 90 degrees.",
    "This bloke said to me, \"I've dropped my Scrabble set all over the road.\" I said, \"What's the word on the street?\"",
    "Beware of alphabet grenades. If one of them goes off, it could spell disaster.",
    "Becoming a vegetarian is a huge missed steak.",
    "Invisible planes, I can't see them taking off.",
    "A small garden bird made of mahogany. It'd be great if I had a related joke...wooden tit?",
    "I'm celebrating 200 years of the buffalo. It's the bison-tennial!",
    "My gun's a newsreader. It's got a bulletin.",
    "I went to this restaurant, and all the food was made by special effects. It was CGI Friday's.",
    "I've got a chicken-proof front lawn. It's impeccable.",
    "Glass windows are a real pane.",
    "Whenever I'm in an airport, I start coughing and sneezing. It's a terminal illness.",
    "I was on a date with a girl and we went back to her place, She had a 10-foot light switch. That was a massive turnoff!",
    "I saw my dad slumped over the lawnmower, crying his eyes out. I said to my mum, \"What's wrong with him?\" She said, \"He's just going through a rough patch.\"",
    "I saw a TV on sale for £1, volume stuck on full. I thought, \"I can't turn that down.\"",
    "I wanted to be a butcher but I didn't make the cut.",
    "I said to this bloke, \"I'm opening a shop in the middle east.\" He said, \"Dubai?\" I said, \"Yes, and sell.\"",
    "This guy said, \"Does every sentence have to contain a vegetable?\" I said, \"Not nece-celery\"",
    "America without a leader: that's unpresidented.",
    "Me and my friend were going to a fancy dress party. My friend said, \"I'm going as a small island off the coast of Italy.\" I said, \"Don't be Sicily.\"",
    "I got a job as a litter removal man. I didn't have any training, just thought I'd pick it up as I go along.",
    "Tennis players don't get married because love means nothing to them.",
    "I saw a baby sheep covered in plastic. Lambinated!",
    "I was at an art exhibition, and the largest painting was gone. I said, \"You're missing the big picture.\"",
    "I went to buy a stretcher. The guy asked if I wanted to try it out first. I said, \"No I don't want to get carried away.\"",
    "Violinists often fiddle around.",
    "Jackhammers, they're groundbreaking.",
    "So what if I can't spell armageddon? It's not the end of the world.",
    "I love heavy metal. My favorite's lead.",
    "Advent calendars- their days are numbered",
    "There are lots of people who are self aware. You know who you are.",
    "Snoring comes easily to me, in fact I can do it in my sleep.",
    "The police think the murder weapon may have been a colander, but that theory doesn't hold water.",
    "I took a poll recently and 100% of people were annoyed that their tent had fallen down.",
    "I'm fed up with my landlord. He's always walking about like he owns the place.",
    "I saw a doctor today with a great sense of humor, he left me in stitches.",
    "When crazy glue was invented lots of people became attached to it.",
    "Russia was slow to recover after WW2 because it kept Stalin around.",
    "What did the thermometer say to the graduated cylinder? \"You may have graduated but I've got many degrees\"",
    "A ship carrying a cargo of red paint collided with a ship carrying a cargo of purple paint. Both crews were marooned.",
    "Some river valleys are absolutely gorges.",
    "What kind of shoes do frogs wear? Open toad.",
    "Over the past year, my sexual fetishes have been slowly getting more perverse; But it wasn't until I spanked a statue that I realized I'd hit rock bottom.",
    "I went to a seafood disco last week and pulled a mussel.",
    "I never let my children listen to jazz or classical music. It is full of sax and violins.",
    "I can't believe I got fired from the calendar factory. All I did was take a day off.",
    "Hey, I love u! It's my favorite vowel.",
    "What do you do with a sick chemist? If you can't helium, and you can't curium, you might as well barium.",
    "Have you met my vegetarian girlfriend? No, I never met herbivore.",
    "The person who invented the door knocker won the No-Bell Prize.",
    "When you’ve seen one shopping center you’ve seen a mall.",
    "Wow, that movie was like camping. It was in tents.",
    "Why do ghouls and demons hang out together? Because demons are a ghoul's best friend.",
    "What do you get when you drop a piano down a mine shaft? A flat minor.",
    "When a clock is hungry it goes back four seconds.",
    "A successful diet is the triumph of mind over platter.",
    "No matter how much you push the envelope, it will still be stationery.",
    "For plumbers, a flush beats a full house.",
    "The lights were too bright at the Chinese restaurant so the manager decided to dim sum.",
    "I went to the store to buy some soup but they were out of stock.",
    "Never lie to an x-ray technician. They can see right through you.",
    "A plateau is a high form of flattery.",
    "Alcohol and calculus don't mix so don't drink and derive.",
    "My girlfriend always gets her way by pretending she's sad. She's an expert in sighcology.",
    "When the TV repairman got married the reception was excellent.",
    "A pet store had a bird contest with no perches necessary.",
    "When the cannibals ate a missionary they got a taste of religion.",
    "A gossip is someone with a great sense of rumor.",
    "It's a lengthy article on Japanese Sword Fighters but I can Samurais it for you.",
    "What do you call cheese that is not yours? Nacho Cheese.",
    "I wish I could travel more but airfare is sky high.",
    "Whiteboards are remarkable.",
    "What are you when you're running in front of a car? Tired. What are you when you're running behind a car? Exhausted.",
    "Time flies like an arrow. Fruit flies like a banana.",
    "I wondered why the baseball was getting bigger. Then it hit me.",
    "What does a house wear? A dress.",
    "I submitted ten jokes to a local newspaper that was giving away $100 for the best joke. Despite multiple efforts to win, no pun in ten did.",
    "I relish the fact that you mustard the energy to ketchup to me.",
    "What do you call a fake noodle? An impasta!",
    "Its hard to explain puns to kleptomaniacs, they always take things litterally.",
    "My leaf blower doesn't work; it sucks.",
    "Why didn't Timmy buy a Mustang? He couldn't afford one.",
    "Did you hear about the guy whose whole left side was cut off? He's all right now.",
    "Don't drink with ghosts, they can't handle their boos.",
    "What the worst thing about throwing a party in space? You have to Planet.",
    "What's the best thing about living in Switzerland? Well, the flag's a big plus.",
    "We should try cross training; Jesus was good at it."   
]
